/*************************************************
版权: 任家硕
作者: 任家硕
日期: 2016-10-15
功能: 机场停机位资源分配优化_航班类
修改历史:

**************************************************/

/*<remark>=========================================================
/// <summary>
/// 机场停机位资源分配优化_航班类
/// </summary>
===========================================================</remark>*/

#pragma once

#include "basic.h"

#pragma region 新建的类
////////////////////////////////////////////////////////////////////////
class Time;// 时间类

////////////////////////////////////////////////////////////////////////
#pragma endregion

class Time
{
public:

	#pragma region Functions
	//////////////////////////////////////////////////////////////////////////

	//
	// 摘要:
	//     字符串转换为时间变量。
	static time_t StringToDatetime(string str);
	//
	// 摘要:
	//     时间变量转换为字符串。
	static string DatetimeToString(time_t time);

	//////////////////////////////////////////////////////////////////////////
	#pragma endregion
};